[
    {
        "titre": " Studio de Dessin Virtuel par Détection de Mouvement",
        "description": "Air Canvas est un studio de dessin virtuel innovant qui utilise la détection de mouvement pour permettre aux utilisateurs de créer des œuvres d'art numériques sans toucher physiquement l'écran. En utilisant la caméra de l'appareil, le système détecte les mouvements de la main de l'utilisateur et les traduit en traits sur un canevas virtuel. Cette application offre une expérience de dessin intuitive et ludique, avec des fonctionnalités telles que le choix de couleurs, l'ajustement de la taille du pinceau, et des modes de dessin et d'effacement. Air Canvas démontre une fusion créative entre l'art numérique et la technologie de reconnaissance gestuelle.",
        "image": "images/AirCanvas.png",
        "lien": "https://moutail.github.io/AirCanvas/",
        "technologies": "HTML5,CSS3,javaScript,MediaPipe Hands,Canvas API,Web Storage API,Font Awesome ,Google Fonts",
        "date": "2024-10-12"
    },
    {
        "titre": "space-shooter",
        "description": "Il s'agit d'un ensemble de catalogues de jeux utilisant la technologie de détection de mouvement par la main.",
        "image": "images/space-shooter.png",
        "lien": "https:\/\/moutail.github.io\/space-shooter\/",
        "technologies": "HTML5,CSS3,javaScript,MediaPipe Hands,Canvas API,Web Storage API",
        "date": "2024-10-12"
    },

    {
        "titre": "Système Solaire Interactif 3D",
        "description": "Une application web interactive en 3D représentant notre système solaire, permettant aux utilisateurs d'explorer les planètes et leurs caractéristiques. L'application offre une expérience immersive avec un vaisseau spatial navigable et des visualisations détaillées des corps célestes.",
        "image": "images/systeme_solaire.png",
        "lien": "https://moutail.github.io/Systeme_solaire/",
        "technologies": "React.js,Three.js, @react-three/drei,WebGL,Custom Shaders (GLSL),Gestion optimisée des ressources 3D",
        "date": "2024-10-24"
    },
    
    {
    "titre": "SKYNET - Visualiseur Musical Avancé",
    "description": "Un visualiseur audio interactif et immersif qui transforme la musique en une expérience visuelle dynamique. Il crée des animations en temps réel basées sur l'analyse des fréquences audio, avec un système de particules réactif et des effets visuels personnalisables.",
    "image": "images/audioVisualizer.png",
    "lien": "https://moutail.github.io/audio-visualizer/",
    "technologies": "HTML5,CSS3,JavaScript ES6+,Web Audio API,Canvas API,RequestAnimationFrame,AudioContext,Interface modulaire,Design responsive",
    "date": "2024-11-14"
    },
    {
        "titre": "VOID HackSimulator - Plateforme d'Apprentissage en Cybersécurité",
        "description": "VOID HackSimulator est une plateforme web complète d'apprentissage en cybersécurité qui simule un environnement de hacking éthique. L'application offre un terminal interactif, un système de défis progressifs, un forum communautaire en temps réel, et un système de gamification complet. Les utilisateurs peuvent apprendre les concepts de sécurité informatique à travers des scénarios pratiques incluant l'exploitation de vulnérabilités, la cryptographie, l'analyse de logs, et la navigation en ligne de commande. La plateforme intègre un système d'authentification JWT, des notifications en temps réel via Socket.io, et une interface d'administration complète pour la gestion des utilisateurs et des contenus.",
        "image": "images/void_hacksimulator.png",
        "lien": "https://void-hacksimulator.onrender.com",
        "technologies": "Node.js,Express.js,MongoDB,Mongoose,Socket.io,JWT Authentication,bcryptjs,React.js,Tailwind CSS,WebSocket,Real-time Notifications,Terminal Emulation,File System Simulation,Gamification System,Admin Dashboard",
        "date": "2024-12-26"
    }
]
